Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: ثم قست قلوبكم من بعد ذلك فهي كالحجارة أو أشد قسوة وإن من الحجارة لما يتفجر منه الأنهار وإن منها لما يشقق فيخرج منه الماء وإن منها لما يهبط من خشية الله وما الله بغافل عما تعملون
en: Then, after that, your hearts were hardened and became as stones or even worse in hardness. And indeed, there are stones out of which rivers gush forth, and indeed, there are of them (stones) which split asunder so that water flows from them, and indeed, there are of them (stones) which fall down for fear of Allah. And Allah is not unaware of what you do.

source: أفتطمعون أن يؤمنوا لكم وقد كان فريق منهم يسمعون كلام الله ثم يحرفونه من بعد ما عقلوه وهم يعلمون
en: Do you (faithful believers) covet that they will believe in your religion inspite of the fact that a party of them (Jewish rabbis) used to hear the Word of Allah [the Taurat (Torah)], then they used to change it knowingly after they understood it?

source: وإذا لقوا الذين آمنوا قالوا آمنا وإذا خلا بعضهم إلى بعض قالوا أتحدثونهم بما فتح الله عليكم ليحاجوكم به عند ربكم أفلا تعقلون
en: And when they (Jews) meet those who believe (Muslims), they say, "We believe", but when they meet one another in private, they say, "Shall you (Jews) tell them (Muslims) what Allah has revealed to you [Jews, about the description and the qualities of Prophet Muhammad صلى الله عليه وسلم, that which are written in the Taurat (Torah)] , that they (Muslims) may argue with you (Jews) about it before your Lord?" Have you (Jews) then no understanding?

source: أولا يعلمون أن الله يعلم ما يسرون وما يعلنون
en: Know they (Jews) not that Allah knows what they conceal and what they reveal?

source: ومنهم أميون لا يعلمون الكتاب إلا أماني وإن هم إلا يظنون
en: And there are among them (Jews) unlettered people, who know not the Book, but they trust upon false desires and they but guess.

source: فويل للذين يكتبون الكتاب بأيديهم ثم يقولون هذا من عند الله ليشتروا به ثمنا قليلا فويل لهم مما كتبت أيديهم وويل لهم مما يكسبون
en: Then woe to those who write the Book with their own hands and then say, "This is from Allah," to purchase with it a little price! Woe to them for what their hands have written and woe to them for that they earn thereby.

source: وقالوا لن تمسنا النار إلا أياما معدودة قل أتخذتم عند الله عهدا فلن يخلف الله عهده أم تقولون على الله ما لا تعلمون
en: And they (Jews) say, "The Fire (i.e. Hell-fire on the Day of Resurrection) shall not touch us but for a few numbered days." Say (O Muhammad صلى الله عليه وسلم to them): "Have you taken a covenant from Allah, so that Allah will not break His Covenant? Or is it that you say of Allah what you know not?"

source: بلى من كسب سيئة وأحاطت به خطيئته فأولئك أصحاب النار هم فيها خالدون
en: Yes! Whosoever earns evil and his sin has surrounded him, they are dwellers of the Fire (i.e. Hell); they will dwell therein forever.

source: والذين آمنوا وعملوا الصالحات أولئك أصحاب الجنة هم فيها خالدون
en: And those who believe (in the Oneness of Allah تعالى - Islamic Monotheism) and do righteous good deeds, they are dwellers of Paradise, they will dwell therein forever. (See V. 2:257)

source: وإذ أخذنا ميثاق بني إسرائيل لا تعبدون إلا الله وبالوالدين إحسانا وذي القربى واليتامى والمساكين وقولوا للناس حسنا وأقيموا الصلاة وآتوا الزكاة ثم توليتم إلا قليلا منكم وأنتم معرضون
en: And (remember) when We took a covenant from the Children of Israel, (saying): Worship none but Allah (Alone) and be dutiful and good to parents, and to kindred, and to orphans and Al-Masakin (the poor), and speak good to people [i.e. enjoin righteousness and forbid evil, and say the truth about Muhammad صلى الله عليه وسلم], and perform As-Salat (Iqamat-as-Salat), and give Zakat. Then you slid back, except a few of you, while you are backsliders. (Tafsir Al-Qurtubi).

source: وإذ أخذنا ميثاقكم لا تسفكون دماءكم ولا تخرجون أنفسكم من دياركم ثم أقررتم وأنتم تشهدون
en: And (remember) when We took your covenant (saying): Shed not the blood of your (people), nor turn out your own people from their dwellings. Then, (this) you ratified and (to this) you bear witness.

source: ثم أنتم هؤلاء تقتلون أنفسكم وتخرجون فريقا منكم من ديارهم تظاهرون عليهم بالإثم والعدوان وإن يأتوكم أسارى تفادوهم وهو محرم عليكم إخراجهم أفتؤمنون ببعض الكتاب وتكفرون ببعض فما جزاء من يفعل ذلك منكم إلا خزي في الحياة الدنيا ويوم القيامة يردون إلى أشد العذاب وما الله بغافل عما تعملون
en: After this, it is you who kill one another and drive out a party of you from their homes, assist (their enemies) against them, in sin and transgression. And if they come to you as captives, you ransom them, although their expulsion was forbidden to you. Then do you believe in a part of the Scripture and reject the rest? Then what is the recompense of those who do so among you, except disgrace in the life of this world, and on the Day of Resurrection they shall be consigned to the most grievous torment. And Allah is not unaware of what you do.

source: أولئك الذين اشتروا الحياة الدنيا بالآخرة فلا يخفف عنهم العذاب ولا هم ينصرون
en: Those are they who have bought the life of this world at the price of the Hereafter. Their torment shall not be lightened nor shall they be helped.

source: ولقد آتينا موسى الكتاب وقفينا من بعده بالرسل وآتينا عيسى ابن مريم البينات وأيدناه بروح القدس أفكلما جاءكم رسول بما لا تهوى أنفسكم استكبرتم ففريقا كذبتم وفريقا تقتلون
en: And indeed, We gave Musa (Moses) the Book and followed him up with a succession of Messengers. And We gave 'Îsa (Jesus), the son of Maryam (Mary), clear signs and supported him with Ruh-ul-Qudus [Jibrael (Gabriel عليه السلام)]. Is it that whenever there came to you a Messenger with what you yourselves desired not, you grew arrogant? Some you disbelieved and some you killed.

source: وقالوا قلوبنا غلف بل لعنهم الله بكفرهم فقليلا ما يؤمنون
en: And they say, "Our hearts are wrapped (i.e. do not hear or understand Allah's Word)." Nay, Allah has cursed them for their disbelief, so little is that which they believe.

source: ولما جاءهم كتاب من عند الله مصدق لما معهم وكانوا من قبل يستفتحون على الذين كفروا فلما جاءهم ما عرفوا كفروا به فلعنة الله على الكافرين
en: And when there came to them (the Jews), a Book (this Qur'an) from Allah confirming what is with them [the Taurat (Torah) and the Injeel (Gospel)], although aforetime they had invoked Allah (for coming of Muhammad صلى الله عليه وسلم) in order to gain victory over those who disbelieved, then when there came to them that which they had recognised, they disbelieved in it. So let the Curse of Allah be on the disbelievers.

source: بئسما اشتروا به أنفسهم أن يكفروا بما أنزل الله بغيا أن ينزل الله من فضله على من يشاء من عباده فباءوا بغضب على غضب وللكافرين عذاب مهين
en: How bad is that for which they have sold their ownselves, that they should disbelieve in that which Allah has revealed (the Qur'an), grudging that Allah should reveal of His Grace unto whom He wills of His slaves. So they have drawn on themselves wrath upon wrath. And for the disbelievers, there is disgracing torment.

source: وإذا قيل لهم آمنوا بما أنزل الله قالوا نؤمن بما أنزل علينا ويكفرون بما وراءه وهو الحق مصدقا لما معهم قل فلم تقتلون أنبياء الله من قبل إن كنتم مؤمنين
en: And when it is said to them (the Jews), "Believe in what Allah has sent down," they say, "We believe in what was sent down to us." And they disbelieve in that which came after it, while it is the truth confirming what is with them. Say (O Muhammad صلى الله عليه وسلم to them): "Why then have you killed the Prophets of Allah aforetime, if you indeed have been believers?"

source: ولقد جاءكم موسى بالبينات ثم اتخذتم العجل من بعده وأنتم ظالمون
en: And indeed Musa (Moses) came to you with clear proofs, yet you worshipped the calf after he left, and you were Zalimun (polytheists and wrongdoers).

source: وإذ أخذنا ميثاقكم ورفعنا فوقكم الطور خذوا ما آتيناكم بقوة واسمعوا قالوا سمعنا وعصينا وأشربوا في قلوبهم العجل بكفرهم قل بئسما يأمركم به إيمانكم إن كنتم مؤمنين
en: And (remember) when We took your covenant and We raised above you the Mount (saying), "Hold firmly to what We have given you and hear (Our Word)." They said, "We have heard and disobeyed." And their hearts absorbed (the worship of) the calf because of their disbelief. Say: "Worst indeed is that which your faith enjoins on you if you are believers."

source: قل إن كانت لكم الدار الآخرة عند الله خالصة من دون الناس فتمنوا الموت إن كنتم صادقين
en: Say to (them): "If the home of the Hereafter with Allah is indeed for you specially and not for others, of mankind, then long for death if you are truthful."

source: ولن يتمنوه أبدا بما قدمت أيديهم والله عليم بالظالمين
en: But they will never long for it because of what their hands have sent before them (i.e. what they have done). And Allah is All-Aware of the Zalimun (polytheists and wrong-doers).

source: ولتجدنهم أحرص الناس على حياة ومن الذين أشركوا يود أحدهم لو يعمر ألف سنة وما هو بمزحزحه من العذاب أن يعمر والله بصير بما يعملون
en: And verily, you will find them (the Jews) the greediest of mankind for life and (even greedier) than those who ascribe partners to Allah (and do not believe in Resurrection - Majus, pagans, and idolaters). Everyone of them wishes that he could be given a life of a thousand years. But the grant of such life will not save him even a little from (due) punishment. And Allah is All-Seer of what they do.

source: قل من كان عدوا لجبريل فإنه نزله على قلبك بإذن الله مصدقا لما بين يديه وهدى وبشرى للمؤمنين
en: Say (O Muhammad صلى الله عليه وسلم): "Whoever is an enemy to Jibril (Gabriel) (let him die in his fury), for indeed he has brought it (this Qur'an) down to your heart by Allah's Permission, confirming what came before it [i.e. the Taurat (Torah) and the Injeel (Gospel)] and guidance and glad tidings for the believers.

source: من كان عدوا لله وملائكته ورسله وجبريل وميكال فإن الله عدو للكافرين
en: Whoever is an enemy to Allah, His Angels, His Messengers, Jibril (Gabriel) and Mika'il (Michael), then verily, Allah is an enemy to the disbelievers."

source: ولقد أنزلنا إليك آيات بينات وما يكفر بها إلا الفاسقون
en: And indeed We have sent down to you manifest Ayat (these Verses of the Qur'an which inform in detail about the news of the Jews and their secret intentions, etc.), and none disbelieve in them but Fasiqun (those who rebel against Allah's Command).

source: أوكلما عاهدوا عهدا نبذه فريق منهم بل أكثرهم لا يؤمنون
en: Is it not (the case) that every time they make a covenant, some party among them throw it aside? Nay! (the truth is:) most of them believe not.

source: ولما جاءهم رسول من عند الله مصدق لما معهم نبذ فريق من الذين أوتوا الكتاب كتاب الله وراء ظهورهم كأنهم لا يعلمون
en: And when there came to them a Messenger from Allah (i.e. Muhammad صلى الله عليه وسلم) confirming what was with them, a party of those who were given the Scripture threw away the Book of Allah behind their backs as if they did not know!

source: واتبعوا ما تتلو الشياطين على ملك سليمان وما كفر سليمان ولكن الشياطين كفروا يعلمون الناس السحر وما أنزل على الملكين ببابل هاروت وماروت وما يعلمان من أحد حتى يقولا إنما نحن فتنة فلا تكفر فيتعلمون منهما ما يفرقون به بين المرء وزوجه وما هم بضارين به من أحد إلا بإذن الله ويتعلمون ما يضرهم ولا ينفعهم ولقد علموا لمن اشتراه ما له في الآخرة من خلاق ولبئس ما شروا به أنفسهم لو كانوا يعلمون
en: They followed what the Shayatin (devils) gave out (falsely of the magic) in the lifetime of Sulaiman (Solomon). Sulaiman did not disbelieve, but the Shayatin (devils) disbelieved, teaching men magic and such things that came down at Babylon to the two angels, Harut and Marut, but neither of these two (angels) taught anyone (such things) till they had said, "We are only for trial, so disbelieve not (by learning this magic from us)." And from these (angels) people learn that by which they cause separation between man and his wife, but they could not thus harm anyone except by Allah's Leave. And they learn that which harms them and profits them not. And indeed they knew that the buyers of it (magic) would have no share in the Hereafter. And how bad indeed was that for which they sold their ownselves, if they but knew.

source: ولو أنهم آمنوا واتقوا لمثوبة من عند الله خير لو كانوا يعلمون
en: And if they had believed, and guarded themselves from evil and kept their duty to Allah, far better would have been the reward from their Lord, if they but knew!

source: يا أيها الذين آمنوا لا تقولوا راعنا وقولوا انظرنا واسمعوا وللكافرين عذاب أليم
en: O you who believe! Say not (to the Messenger صلى الله عليه وسلم) Ra'ina but say Unzurna (make us understand) and hear. And for the disbelievers there is a painful torment. (See Verse 4:46)

source: ما يود الذين كفروا من أهل الكتاب ولا المشركين أن ينزل عليكم من خير من ربكم والله يختص برحمته من يشاء والله ذو الفضل العظيم
en: Neither those who disbelieve among the people of the Scripture (Jews and Christians) nor Al-Mushrikun (the idolaters, polytheists, disbelievers in the Oneness of Allah, pagans, etc.) like that there should be sent down unto you any good from your Lord. But Allah chooses for His Mercy whom He wills. And Allah is the Owner of Great Bounty.

source: ما ننسخ من آية أو ننسها نأت بخير منها أو مثلها ألم تعلم أن الله على كل شيء قدير
en: Whatever a Verse (revelation) do We abrogate or cause to be forgotten, We bring a better one or similar to it. Know you not that Allah is able to do all things?

source: ألم تعلم أن الله له ملك السماوات والأرض وما لكم من دون الله من ولي ولا نصير
en: Know you not that it is Allah to Whom belongs the dominion of the heavens and the earth? And besides Allah you have neither any Wali (protector or guardian) nor any helper.

source: أم تريدون أن تسألوا رسولكم كما سئل موسى من قبل ومن يتبدل الكفر بالإيمان فقد ضل سواء السبيل
en: Or do you want to ask your Messenger (Muhammad صلى الله عليه وسلم) as Musa (Moses) was asked before (i.e. show us openly our Lord)? And he who changes Faith for disbelief, verily, he has gone astray from the Right Way.

source: ود كثير من أهل الكتاب لو يردونكم من بعد إيمانكم كفارا حسدا من عند أنفسهم من بعد ما تبين لهم الحق فاعفوا واصفحوا حتى يأتي الله بأمره إن الله على كل شيء قدير
en: Many of the people of the Scripture (Jews and Christians) wish that if they could turn you away as disbelievers after you have believed, out of envy from their ownselves, even after the truth (that Muhammad صلى الله عليه وسلم is Allah's Messenger) has become manifest unto them. But forgive and overlook, till Allah brings His Command. Verily, Allah is Able to do all things.

source: وأقيموا الصلاة وآتوا الزكاة وما تقدموا لأنفسكم من خير تجدوه عند الله إن الله بما تعملون بصير
en: And perform As-Salat (Iqamat-as-Salat), and give Zakat and whatever of good (deeds that Allah loves) you send forth for yourselves before you, you shall find it with Allah. Certainly, Allah is All-Seer of what you do.

source: وقالوا لن يدخل الجنة إلا من كان هودا أو نصارى تلك أمانيهم قل هاتوا برهانكم إن كنتم صادقين
en: And they say, "None shall enter Paradise unless he be a Jew or a Christian." These are their own desires. Say (O Muhammad صلى الله عليه وسلم), "Produce your proof if you are truthful."

source: بلى من أسلم وجهه لله وهو محسن فله أجره عند ربه ولا خوف عليهم ولا هم يحزنون
en: Yes, but whoever submits his face (himself) to Allah (i.e. follows Allah's Religion of Islamic Monotheism) and he is a Muhsin then his reward is with his Lord (Allah), on such shall be no fear, nor shall they grieve. [See Tafsir Ibn Kathir ].

source: وقالت اليهود ليست النصارى على شيء وقالت النصارى ليست اليهود على شيء وهم يتلون الكتاب كذلك قال الذين لا يعلمون مثل قولهم فالله يحكم بينهم يوم القيامة فيما كانوا فيه يختلفون
en: The Jews said that the Christians follow nothing (i.e. are not on the right religion); and the Christians said that the Jews follow nothing (i.e. are not on the right religion); though they both recite the Scripture. Like unto their word, said (the pagans) who know not. Allah will judge between them on the Day of Resurrection about that wherein they have been differing.

source: ومن أظلم ممن منع مساجد الله أن يذكر فيها اسمه وسعى في خرابها أولئك ما كان لهم أن يدخلوها إلا خائفين لهم في الدنيا خزي ولهم في الآخرة عذاب عظيم
en: And who are more unjust than those who forbid that Allah's Name be glorified and mentioned much (i.e. prayers and invocations, etc.) in Allah's Mosques and strive for their ruin? It was not fitting that such should themselves enter them (Allah's Mosques) except in fear. For them there is disgrace in this world, and they will have a great torment in the Hereafter.

source: ولله المشرق والمغرب فأينما تولوا فثم وجه الله إن الله واسع عليم
en: And to Allah belong the east and the west, so wherever you turn (yourselves or your faces) there is the Face of Allah (and He is High above, over His Throne). Surely! Allah is All-Sufficient for His creatures' needs, All-Knowing.

source: وقالوا اتخذ الله ولدا سبحانه بل له ما في السماوات والأرض كل له قانتون
en: And they (Jews, Christians and pagans) say: Allah has begotten a son (children or offspring) . Glory be to Him (Exalted be He above all that they associate with Him). Nay, to Him belongs all that is in the heavens and on earth, and all surrender with obedience (in worship) to Him.

source: بديع السماوات والأرض وإذا قضى أمرا فإنما يقول له كن فيكون
en: The Originator of the heavens and the earth. When He decrees a matter, He only says to it: "Be!" - and it is.

source: وقال الذين لا يعلمون لولا يكلمنا الله أو تأتينا آية كذلك قال الذين من قبلهم مثل قولهم تشابهت قلوبهم قد بينا الآيات لقوم يوقنون
en: And those who have no knowledge say: "Why does not Allah speak to us (face to face) or why does not a sign come to us?" So said the people before them words of similar import. Their hearts are alike, We have indeed made plain the signs for people who believe with certainty.

source: إنا أرسلناك بالحق بشيرا ونذيرا ولا تسأل عن أصحاب الجحيم
en: Verily, We have sent you (O Muhammad صلى الله عليه وسلم) with the truth (Islam), a bringer of glad tidings (for those who believe in what you brought, that they will enter Paradise) and a warner (for those who disbelieve in what you brought, that they will enter the Hell-fire). And you will not be asked about the dwellers of the blazing Fire.

source: ولن ترضى عنك اليهود ولا النصارى حتى تتبع ملتهم قل إن هدى الله هو الهدى ولئن اتبعت أهواءهم بعد الذي جاءك من العلم ما لك من الله من ولي ولا نصير
en: Never will the Jews nor the Christians be pleased with you (O Muhammad صلى الله عليه وسلم) till you follow their religion. Say: "Verily, the Guidance of Allah (i.e. Islamic Monotheism) that is the (only) Guidance. And if you (O Muhammad صلى الله عليه وسلم) were to follow their (Jews and Christians) desires after what you have received of Knowledge (i.e. the Qur'an), then you would have against Allah neither any Wali (protector or guardian) nor any helper.

source: الذين آتيناهم الكتاب يتلونه حق تلاوته أولئك يؤمنون به ومن يكفر به فأولئك هم الخاسرون
en: Those (who embraced Islam from Bani Israel) to whom We gave the Book [the Taurat (Torah)] [or those (Muhammad's صلى الله عليه وسلم companions) to whom We have given the Book (the Qur'an)] recite it (i.e. obey its orders and follow its teachings) as it should be recited (i.e. followed), they are the ones who believe therein. And whoso disbelieve in it (the Qur'an), those are they who are the losers. (Tafsir Al-Qurtubi).

source: واتقوا يوما لا تجزي نفس عن نفس شيئا ولا يقبل منها عدل ولا تنفعها شفاعة ولا هم ينصرون
en: And fear the Day (of Judgement) when no person shall avail another, nor shall compensation be accepted from him, nor shall intercession be of use to him, nor shall they be helped.

source: وإذ ابتلى إبراهيم ربه بكلمات فأتمهن قال إني جاعلك للناس إماما قال ومن ذريتي قال لا ينال عهدي الظالمين
en: And (remember) when the Lord of Ibrahim (Abraham) [i.e., Allah] tried him with (certain) Commands, which he fulfilled. He (Allah) said (to him), "Verily, I am going to make you an Imam (a leader) for mankind (to follow you)." [Ibrahim (Abraham)] said, "And of my offspring (to make leaders)." (Allah) said, "My Covenant (Prophethood) includes not Zalimun (polytheists and wrong-doers)."

source: وإذ جعلنا البيت مثابة للناس وأمنا واتخذوا من مقام إبراهيم مصلى وعهدنا إلى إبراهيم وإسماعيل أن طهرا بيتي للطائفين والعاكفين والركع السجود
en: And (remember) when We made the House (the Ka'bah at Makkah) a place of resort for mankind and a place of safety. And take you (people) the Maqam (place) of Ibrahim (Abraham) [or the stone on which Ibrahim (Abraham) عليه السلام stood while he was building the Ka'bah] as a place of prayer (for some of your prayers, e.g. two Rak'at after the Tawaf of the Ka'bahat Makkah), and We commanded Ibrahim (Abraham) and Isma'il (Ishmael) that they should purify My House (the Ka'bah at Makkah) for those who are circumambulating it, or staying (I'tikaf), or bowing or prostrating themselves (there, in prayer).

source: وإذ قال إبراهيم رب اجعل هذا بلدا آمنا وارزق أهله من الثمرات من آمن منهم بالله واليوم الآخر قال ومن كفر فأمتعه قليلا ثم أضطره إلى عذاب النار وبئس المصير
en: And (remember) when Ibrahim (Abraham) said, "My Lord, make this city (Makkah) a place of security and provide its people with fruits, such of them as believe in Allah and the Last Day." He (Allah) answered: "As for him who disbelieves, I shall leave him in contentment for a while, then I shall compel him to the torment of the Fire, and worst indeed is that destination!"

source: وإذ يرفع إبراهيم القواعد من البيت وإسماعيل ربنا تقبل منا إنك أنت السميع العليم
en: And (remember) when Ibrahim (Abraham) and (his son) Isma'il (Ishmael) were raising the foundations of the House (the Ka'bah at Makkah), (saying), "Our Lord! Accept (this service) from us. Verily! You are the All-Hearer, the All-Knower."

source: ربنا واجعلنا مسلمين لك ومن ذريتنا أمة مسلمة لك وأرنا مناسكنا وتب علينا إنك أنت التواب الرحيم
en: Our Lord! And make us submissive unto You and of our offspring a nation submissive unto You, and show us our Manasik (all the ceremonies of pilgrimage - Hajjand 'Umrah), and accept our repentance. Truly, You are the One Who accepts repentance, the Most Merciful.

source: ربنا وابعث فيهم رسولا منهم يتلو عليهم آياتك ويعلمهم الكتاب والحكمة ويزكيهم إنك أنت العزيز الحكيم
en: Our Lord! Send amongst them a Messenger of their own (and indeed Allah answered their invocation by sending Muhammad صلى الله عليه وسلم), who shall recite unto them Your Verses and instruct them in the Book (this Qur'an) and Al-Hikmah (full knowledge of the Islamic laws and jurisprudence or wisdom or Prophethood), and purify them. Verily! You are the All-Mighty, the All-Wise."

source: ومن يرغب عن ملة إبراهيم إلا من سفه نفسه ولقد اصطفيناه في الدنيا وإنه في الآخرة لمن الصالحين
en: And who turns away from the religion of Ibrahim (Abraham) (i.e. Islamic Monotheism) except him who befools himself? Truly, We chose him in this world and verily, in the Hereafter he will be among the righteous.

source: إذ قال له ربه أسلم قال أسلمت لرب العالمين
en: When his Lord said to him, "Submit (i.e. be a Muslim)!" He said, "I have submitted myself (as a Muslim) to the Lord of the 'Alamin (mankind, jinn and all that exists)."

source: ووصى بها إبراهيم بنيه ويعقوب يا بني إن الله اصطفى لكم الدين فلا تموتن إلا وأنتم مسلمون
en: And this (submission to Allah, Islam) was enjoined by Ibrahim (Abraham) upon his sons and by Ya'qub (Jacob) (saying), "O my sons! Allah has chosen for you the (true) religion, then die not except in the Faith of Islam (as Muslims - Islamic Monotheism)."
